app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'Marco The Dev'
OR `email` = 'Marco The Dev'
 LIMIT 1
---
    public function processLogin()
    {
        $rules = [
            'username' => 'required',
            'password' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $userModel = new UserModel();
        $username  = $this->request->getPost('username');
        $password  = $this->request->getPost('password');

        // allow logging in via username or email
        $user = $userModel->where('username', $username)
                          ->orWhere('email', $username)
                          ->first();